# controf flow არის როდესაც კომპიუტერი მიყვება მოქმედებებს ნაბიჯ-ნაბიჯ.

# control flow 3 ტიპი არსებობს ესენია : Sequencing, Iteration და Selection .

# Sequencing : კოდის თანმიმდევრობით გაშვება (ზევიდან ქვევით)

# Iteration : იტერაცია (კოდის განმეორება)

# Selection : კოდში არჩევანის გაკეთება

#ალგორითმი არის გეგმასავით ნაბიჯ-ნაბიჯ ინსტრუქციები, რაც გვეხმარება, რომ რაღაც ამოცანა სწორას და ბოლომდე მოვააგვაროთ 

# ცხოვრებიდან მაგალითები : ყავის გაკეთბა, საჭმლის მომზადება და სათამაშოს აწყობა 

# პროგრამირების მაგალითები : ორი რიცხვის შედარება,  რიცხვია თუ მთელი და უდიდესი რიცხვის პოვნაბ სამიდან.

# 3 ტიპის ალგორითმი არსებობს ესენია : Flowchart, Pseudocode და Natural Language

# Flowchart : კოდის სქემატურად გამოსახვა

# Pseudocode : პროგრამირების ენასთან მიახლოვებული კოდი

# Natural Language : ბუნებრივი ენით ახსნილი/დაწერილი კოდი

