# print =
# return =
# # 1) დაწერეთ ფუნქცია, რომელიც მიიღებს რიცხვს და დააბრუნებს მის ორმაგ მნიშვნელობას.
def greet({num}, {multiply}):
     multiply = 2
     num * 2
greet(3)


# 2)შექმენით ფუნქცია, რომელსაც არგუმენტად გადასცემთ 3 რიცხვს. ამ ფუნქციამ პასუხად უნდა დააბრუნოს პირველი ორი რიცხვის ჯამი გაყოფილი მესამე რიცხვზე.
def nums(a, b, c):
    print({a+b} / {c})
nums(2,3,4)
  
# 3) შექმენი ფუნქცია, რომელიც არგუმენტად მიიღებს მასივს და ტერმინალში დაბეჭდავს ყველა ელემენტს.

# 4)თქვენი სიტყვებით ახსენით თუ რა განსხვავებაა print-სა და return keyword-ებს შორის.

# მოცემული დავალებების შესასრულებლად გამოიყენეთ return keyword.
