# 2) ჩამოწერეთ პირობითი განცხადებების შემადგენელი ყველა Keyword-ი, თითოეულს თან დაურთეთ განმარტება და თქვენი სიტყვებით ახსენით თუ რატომ/რა შემთხვევებში არის elif keyword-ი საჭირო.

# if თან ვწერთ პირობას და დასაწყიში ვიყენებთ
# elif თანაც ვწერთ პირობას მაგრამ if ის მერე ვწერთ
# else არ უნდა პირობა და elif ან if მერე იწერება


# 3) ცვლადში შეინახეთ თქვენი ასაკი. შემდეგ მომხმარებელს შემოატანინეთ თავისი ასაკი. თუ თქვენი გვარები დაემთხვევა გამოიტანეთ "We are the same age", სხვა შემთხვევაში - "We are not the same age".

age1 = 14
age2 = int(input("Enter your age: "))
if age1 == age2:
    print("we are the same age ")
else: 
    age1 != age2 
    print("we are not the same age")

# 4) დააკვირდით მოცემულ flowchart-ს, ახსენით მისი მუშაობის პრინციპი. მისი მიხედვით Vscode-ში დაწერეთ პროგრამა და აღწერეთ რა შედეგს გამოიტანს კოდი იმ შემთხვევაში, როდესაც მომხმარებელი არის 14 წლის და არ არის სტუდენტი.

# თუ მომხმარებელი 18 წელზე მეტის იქქნება კომპიუტერი დაუწერს regular price-ს თუ მომხმარებელი 18-ზე ნაკლების იქნება კომპიუტერი შემდეგ კითხვას დაუსვავს თუ 13 - ზე ნაკლებს მიუთითებს 10% ფასდაკლებას გამოიტანს თუ მეტს მიუთითებს 20% ფასდაკლებას გამოუტანს.

# HARD LVL 

# 5) დაწერეთ პროგრამა, რომელიც მომხმარებლს მოსთხოვს, რომ შემოიტანოს დადებითი რიცხვი. 
# თუ მომხმარებელი შემოიტანს უარყოფით რიცხვს ან ნულს, პროგრამამ უნდა მოსთხოვოს რიცხვის თავიდან შემოტანა

