# 2) თქვენი სიტყვებით ახსენით:
# • რას ეწოდება ფუნქცია?
# • რისთვის გამოიყენება ფუნქციები Python-ში.

# ფუნქცია პითონში არის მაგ: str() , int() , float() , bool() , input() , print() , range()  
# იმისთვის რომ გაგვიმარტივდეს კოდის წერა

# 3) კომენტარის სახით დაწერეთ, რას ეწოდება არგუმენტი. როგორც გაკვეთილზე ავხსენით ნახაზის საშუალებით - ასევე თქვენც გევალებათ, რომ Paint-ში ახსნათ ფუნქციის სინტაქსი და მისი არგუმენტები.
# არგუმენტი არის ის სასაც გადავცემთ ბრჩხილებში.

# 4) შექმენით ისეთი სია, სადაც შეინახავთ ყველა ნასწავლ მონაცემთა ტიპს ორ-ორჯერ, რომლებსაც მოათავსებთ სხვადასხვა ინდექსებზე. ბოლოს ინდექსინგის საშუალებით გამოიტანეთ მხოლოდ Boolean მნიშვნელობები.
data = [10, 3.14, "hello", True, False, "world", 20, 2.71]


bool1 = data[3]
bool2 = data[4]

print(f"Boolean means are:", {bool1}, "and", {bool2})

# 5) შექმენთი სია [2, 4, 6, 8, 10].
# გადაუარეთ for ციკლით და სიის ელემენტების გაორმაგებული მნიშვნელობები ეკრანზე დაბეჭდეთ.
list = [2, 4, 6, 8, 10]
for i in list:
    print(i * 2)         
# 6) იპოვეთ და დაბეჭდეთ 1-დან 100-მდე რიცხვების თანმიმდებრობიდან მხოლოდ ის რიცხვები, რომლებიც იყოფა 5-ზე.
# -- while loop --
for i in range(1,101):
    if i % 5 == 0:
        print(i)


# 7) დაწერეთ პროგრამა, სადაც მომხმარებელს შემოატანინებთ რიცხვებს მანამ, სანამ ის არ შეიყვანს 0-ს. ბოლოს დაბეჭდეთ ყველა მცდელობაზე შემოტანილი რიცხვების ჯამი.
num = int(input("Enter a number"))
total = 0
while num != 0:
    total += num
    num = int(input("Enter a number"))
print(f"sum of numbers are {total}")
# 8) while loop-ის გამოყენებით იპოვეთ და დაბეჭდეთ 1-დან 30-მდე მხოლოდ ლუწი რიცხვები.
# -- Indexing & Slicing --
number = 1
while number <= 30:
    if number % 2 == 0:
        print(number)
    number += 1

# 9) დაწერეთ პროგრამა, სადაც მომხმარებელს აარჩევინებთ ნებისმიერ სტრინგს, შემდეგ კი მოცემული სტრინგიდან მხოლოდ კენტ ინდექსზე მდგომ ელემენტებს გამოიტანს ტერმინალში.\
# -- Conditional Statements --

text = input("Enter a text: ")
result = text[1::2]
print("odd plase indexs are:", result)


# 10) დაწერეთ პროგრამა, რომელიც შეადარებს მომხმარენლის მიერ შემოტანილ ორ რიცხვს და დაბეჭდავს, რომელი უფრო მეტია ან ტოლია.
num1 = float(input("Enter first num: "))
num2 = float(input("Enter second num: "))

if num1 > num2:
    print("first is greater.")
elif num1 < num2:
    print("second is greater.")
else:
    print("num same.")

# 11) მომხმარებელს შემოატანინეთ ასაკი. გამოიყენეთ პირობითი განცხადებები რომ შექმნათ პროგრამა, სადაც - იმ შემთხვევაში თუ User იქნება 13 წელზე ნაკლენბი ასაკის გამოიტანთ 'You are a child'. თუ იქნება 13 წელზე მეტი, მაგრამ 18-ზე ნაკლები ასაკის დაუბეჭდეთ 'You are a teen'. თუ 18 წელზე მეტის იქნება დაუბეჭდეთ 'You are an adult.'
age = int(input("Enter your age: "))
if age < 13:
    print("You are a child.")
elif age < 18:
    print("You are a teen.")
else:
    print("You are an adult.")