# 1) შექმენით items ცვლადი, რომელშიც შინახავთ მინიმუმ 10 ტექნიკას (მაგ. კომპიუტერი, მიკროფონი, ა.შ). გამოიტანეთ Items სიიდან ყოველი მეოთხე ელემენტი Slicing-ის გამოყენებით.
items = ["computer", "microphone", "radio", "phone", "tablet", "TV", "laptop", "ps4", "micro", "headphone"]
print(items[::4])

# 2) ცვლადში შეინახეთ თქვენი სახელი და გვარი, ჯერ დაბეჭდეთ ტავდაპირველი ვერსია, შემდეგ კი შებრუნებული.
name = "Andria_Gikashvili"
print(name[:])
print(name[::-1])


# 3) შექმენით Fruits ცვლადი და შეინახეთ მასში მინიმუმ 7ც ხილი. შეაბრუნეთ Fruits სია, შემდეგ Slicing-ის გამოყენებით გამოიტანეთ სიის ბოლო 3 ელემენტი.
fruits = ["apple", "mango", "banana", "watermelon", "peach", "melon", "chear"]
print(fruits[4:])

# # 4) რას ეწოდება Slicing? ახსენით დეტალურად კომენტარებით. ამასთანავე ახსენით Slicing-ის სინტაქსი (პლიუს start, stop, step როგორ მუშაობს)
# slicing არის სიიდან რაღაცა ნაწილის ამოღება.  start არის საიდანაც ვიწყებთ ათვლას stop არის სადაც ვამთავრებთ ათვლას step რამდენით გამოტოვოთ

# # 5) მოიყვანეთ მაგალითი თუ რატომ არის სტრინგი შუცვლელიმონაცემის ტიპი და თუ რატომაა სია შეცვლადი.

# იმიტომ რომ string არის imutable ხოლო სია mutable