# 2) მოცემულია სტრინგი: "Programming"
#     დაბეჭდეთ მხოლოდ პირველი 5 სიმბოლო.
#     • დაბეჭდეთ ბოლო 3 სიმბოლო.
#     • დაბეჭდეთ სტრინგი შებრუნებულად.
word = "Programming"
print(word[:5])
print(word[8:])
print(word[::-1])
# 3) მოცემულია სია: fruits = ['apple', 'banana', 'cherry', 'date', 'fig', 'grape']
#   ჯერ სიიდან ამოიღეთ შუა სამი ელემენტი, შემდეგ დაბეჭდეთ სიის ყოველი მეორე ელემენტი.
fruits = ['apple', 'banana', 'cherry', 'date', 'fig', 'grape']
print(fruits[2:5])
print(fruits[1:4])
print(fruits[::2])
# 4)  ცვლადში შეინახეთ სტრინგი, სადაც Alphabet-ის ყველა ასოს ჩაწერთ. 
#     • ამოიღეთ სტრინდიდან ყველა მესამე სიმბოლო Slicing-ის გამოყენებით.
#    • შებრუნებული სტრინგიდან ამოღეთ მხოლოდ ყოველი მეორე სიმბოლო.
Alphabet = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'G', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z' ]
print(Alphabet[::3])
print(Alphabet[::-2])
# 5) მოცემულია სტრინგი: text = "IndexingAndSlicingIsPowerful"
# ამოიღეთ text ცვლადიდან სიტყვა "Slicing". შემდეგ შეაბრუნეთ და გამოიტანეთ შედეგის სახით ეკრანზე.
text = "IndexingAndSlicingIsPowerful"
print(text[11:18])
print(text[::-1])
# 6) მოცემულია სტრინგი: word = "Programming"
#    • დაბეჭდეთ სტრინგი უკუღმა ისე, რომ გამოტოვებული იყოს ყოველი მეორე ასო.
#    • ამოჭერით სტრინგი შუა სამი ასო.
#    • შეაერთეთ მხოლოდ ლუწ ინდექსებზე მყოფი ასოები.
word1 = "Programming"
print(word1[::-2])
print(word1[4:7])
print(word1[1] + word1[3] + word1[5] + word1[7] + word1[9])
# 7) შექმენით ცვლადი alphabet = "abcdefghijklmnopqrstuvwxyz"
#  შექმენი სიტყვა "python" ამ სტრინგიდან ინდექსების კომბინაციით.
alphabet = "abcdefghijklmnopqrstuvwxyz"
word = alphabet[15] + alphabet[24] + alphabet[19] + alphabet[7] + alphabet[14] + alphabet[13]
print(word)

# 8) მოცემულია სია: nums = [0, 10, 20, 30, 40, 50, 60, 70]
#    • ამოჭერით სიიდან ბოლო სამი ელემენტი.
#    • ამოიღეთ ელემენტები 20-დან 50-ის ჩათვლით.
nums = [0, 10, 20, 30, 40, 50, 60, 70]
print(nums[-3:])
print(nums[2:6])
# 9) Level 29-ზე დაწყებული Html პროექტისთვის შეადგინეთ (მხოლოდ) Products სექციის კოდი, ჩემი მინიშნების გარეშე მოიფიქრეთ, თუ რა კომპონენტები უნდა დაამატოთ წიგნების გასაყიდ გვერდს. თქვენს მიერ აწყობილი გვერდი გასტილეთ CSS-ის გამოყენებით ცისფერ/ლურჯ თემაში, ფერების ასარჩევად გადადით რესურსებში ჩაგდებული საიტის ლინკზე. რომლის გვერდიც ყველაზე მეტად მომეწონება, იმაზე დაყრდნობით ავაგებ ჩვენი წიგნების საიტისთვის სტილსა და სტრუქტურას შემდეგ Html-ს გაკვეთილზე.
# წარმატებები:)