#  ბრჭყალებში ჩაწერილ რიცხვსა და ჩვეულებრივ ინტეჯერ რიცხვს შორის ის არის განსხვავება რომ სტრინგი არ ემატება ინტეგერს იმიტომ რომ სტრინგი სტრინგს უნდა დაემატოს ხოლო ინტეგერი ნაკლებ ადგილს იკავებს კოდირებაში

Name = "Andria"
Surname = "Gikashvili"
print( Name + Surname )

cafe = 50
coffee = 20
print( cafe +  coffee )

java = 60
script = 30 
print( java - script )

flat = 45
apartament = 35
print( flat + apartament ) 

Nike = 10
Puma = 5
print( Nike + Puma )

#Python შეიქმნა 1989 წელს ჰოლანდიელი პროგრამისტის გიდო ვან როსუმის მიერ და ოფიციალურად გამოვიდა 1991 წელს. ენა დაარქვა Python, რადგან იყო დიდი თაყვანისმცემელი ბრიტანული კომედიური ჯგუფის Monty Python's Flying Circus-ის. გიდო მოისურვა, რომ ენის სახელი ყოფილიყო სახალისო და არ დაკავშირებული ტექნიკურ ტერმინებთან.
