# 1) დაწერეთ თქვენი ვარაუდი: რას გამოიტანს ეს კოდი?
# *fruit1, fruit2, fruit3 = fruits
# თუ სიაშინ იქნება 5 ელემენტი ამ შემთხვევაში პირველ სამ ელემენტს fruit1 შევინახავთ ხოლო fruit2 fruit3 დანარჩენი ბოლო 2 ელემენტი დაიკავებს თანმიმდევრობით
# 2) ახსენით რას აკეთებს Asterisk ოპერატორი და მოიყვანეთ რამოდენიმე მაგალითი.
# ასტერიქსი ოპერატორი (1 დავალებიდან) სიაში თუ 5 ელემენტი გვაქვს და 3 "ბოქსი" ერორი რომ  არ გამოიწვიოს ამისთვის ასტერიქსი პირველ სამ ოპერატორს დაიკავებს და ადგილს დაუტოვებს დანარჩენ ორ "ყუთს" 
# 3) ჩამოწერეთ რა მსგავსება და განსხვავებაა List-ებსა და Tuple-ბს შორის.
# list - mutable  tuple - imutable
# 4) შექმენით Tuple, სადაც შეინახავთ 7 ელემენტს. გამოიყენეთ Tuple Unpacking იმისთვის, რომ 4 სხვადასხვა ცვლადში გადაანაწილოთ Tuple-ის ელემენტები. ოთხივე ცვლადი დაბეჭდეთ ტერმინალში.

car_brands = ('BMW', 'MERCEDES', 'AUDI', 'PORCHE', 'SUBARU', 'NISSAN', 'TOYOTA')
*CAR1, CAR2, CAR3, CAR4 = car_brands
print(CAR1)
print(CAR2)
print(CAR3)
print(CAR4)